import Layout from "@/components/Layout";

export default function About() {
  return (
    <Layout>
      <h1>Про мене</h1>
      <p>
        Привіт! Мене звати Надія, і я — фронтенд-розробниця, що спеціалізується
        на створенні адаптивних та інтерактивних веб-інтерфейсів.
      </p>
      <p>
        Мій шлях в IT — це історія про пристрасть та наполегливість. Я пишаюся
        тим, що стала світчером, адже це доказ моєї цілеспрямованості. За
        плечима — роки пошуків себе, навчання та, зрештою, успішне завершення
        Mate Academy.
      </p>
      <p>
        На сьогодні я маю більше ніж пів року практичного досвіду у розробці
        проєктів з використанням:
      </p>
      <ul>
        <li>JavaScript, TypeScript</li>
        <li>React</li>
        <li>HTML, CSS</li>
        <li>Git, Figma</li>
        <li>Робота з API</li>
      </ul>
      <p>
        Я вважаю, що вік чи стать не є перешкодою до розвитку, а лише додатковим
        досвідом. Мій попередній досвід та вміння долати труднощі дозволяють
        мені швидко адаптуватися до нових викликів. Я з легкістю занурююсь у
        логіку компонентів, люблю працювати в команді та ціную відкрите,
        нетоксичне спілкування.
      </p>
      <p>
        Я прагну знайти команду, де зможу не тільки застосувати свої знання, але
        й зростати як професіонал. Якщо ви шукаєте щирого, відданого та
        наполегливого розробника — я та, кого ви шукаєте.
      </p>
    </Layout>
  );
}
